Repository: congbo/default-browser-switcher
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# menu.settings
source: Settings…
zh_hans: 设置…

# settings.launchAtLogin.approvalRequired
source: Allow this app in System Settings before it can launch at login.
zh_hans: 需要先在“系统设置”中允许此应用，才能在登录时启动。

# settings.launchAtLogin.disabled
source: Off until you open the app yourself.
zh_hans: 不会自动打开，需要你手动启动。

# settings.launchAtLogin.enabled
source: Opens automatically when you sign in.
zh_hans: 登录时会自动打开。

# settings.launchAtLogin.loading
source: Checking login item status…
zh_hans: 正在检查登录项状态…

# settings.launchAtLogin.refresh
source: Refresh launch-at-login status
zh_hans: 刷新登录时启动状态

# settings.launchAtLogin.retry
source: Retry launch-at-login check
zh_hans: 重试登录时启动检查

# settings.launchAtLogin.section
source: Launch at login
zh_hans: 登录时启动

# settings.launchAtLogin.toggle
source: Open Default Browser Switcher when I sign in
zh_hans: 登录时自动打开 Default Browser Switcher

# settings.launchAtLogin.unavailable
source: This Mac can't enable launch at login for this app.
zh_hans: 这台 Mac 无法为此应用启用登录时启动。

# settings.refresh
source: Refresh browser discovery
zh_hans: 刷新浏览器发现结果

# settings.refresh.description
source: Re-read the current default browser and available browser list from the latest system discovery result.
zh_hans: 重新读取当前默认浏览器状态和可选浏览器列表，同步最新的系统发现结果。

# settings.refresh.section
source: Browser discovery
zh_hans: 浏览器发现结果

# settings.switchMode.description
source: Choose how Default Browser Switcher updates the system default browser.
zh_hans: 选择 Default Browser Switcher 更新系统默认浏览器的方式。

# settings.switchMode.detail.launchServicesDirect
source: LaunchServices Direct rewrites the user browser handlers first. It is usually faster and avoids the confirmation dialog, but it is a lower-level compatibility path.
zh_hans: LaunchServices Direct 会直接改写当前用户的浏览器处理器设置。它通常更快，也更可能避免确认弹框，但属于更底层、兼容性风险更高的路径。

# settings.switchMode.detail.systemPrompt
source: System Prompt uses the official macOS API. It is the most conservative path, but macOS may ask you to confirm the browser change.
zh_hans: System Prompt 使用 macOS 官方 API。它是更保守的路径，但 macOS 可能会要求你确认浏览器切换。

# settings.switchMode.label
source: Switch implementation
zh_hans: 切换实现

# settings.switchMode.section
source: Switch mode
zh_hans: 切换模式

# settings.logs
source: Logs
zh_hans: 日志

# settings.logs.empty
source: No browser switch logs yet in this app session.
zh_hans: 本次运行还没有切换日志

# settings.logs.level.error
source: Error
zh_hans: 错误

# settings.logs.level.info
source: Info
zh_hans: 信息

# settings.logs.level.warning
source: Warning
zh_hans: 警告

# settings.logs.refresh
source: Refresh current browser
zh_hans: 刷新当前浏览器

# settings.logs.stage.refresh
source: Refresh
zh_hans: 刷新

# settings.logs.stage.switch
source: Switch
zh_hans: 切换

# settings.logs.stage.verification
source: Verification
zh_hans: 校验

# settings.optimisticVerification.unconfirmed
source: The browser switch was submitted, but verification has not caught up yet.
zh_hans: 浏览器切换请求已提交，但校验结果暂时还没有跟上。
